Returns true if the operation associated with this instance has been cancelled.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public bool IsCancelled()
  Visual Basic
Public Function IsCancelled As Boolean
  Visual C++
public:
bool IsCancelled()
 See Also
  CancellationListener Class
  Autodesk.Revit.DB Namespace